uhnp/src/Documents/тн_РегистрацияНаценкиНаПродажу/тн_РегистрацияНаценкиНаПродажу.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>тн_РегистрацияНаценкиНаПродажу</name>
  <comment>Выполнение задач №000040782</comment>
  <registerRecords>InformationRegister.тн_СведенияОНаценкеТНСС</registerRecords>
  <tabularSections>
    <name>Наценка</name>
    <attributes>
      <name>Контрагент</name>
      <type>
        <types>CatalogRef.Контрагенты</types>
      </type>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <type>
        <types>CatalogRef.Номенклатура</types>
      </type>
    </attributes>
    <attributes>
      <name>ВыручкаБезНДС</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>СебестоимостьПродаж</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Наценка</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ПроцентНаценки</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>2</scale>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Количество</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Document>

uhnp/src/Documents/тн_РегистрацияНаценкиНаПродажу/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
#Область СлужебныеПроцедурыИФункции

#Область Проведение
// Федоров Максим 25.03.2022 Выполнение задач №000040782
// Описывает учетные механизмы используемые в документе для регистрации в механизме проведения.
//
// Параметры:
//  МеханизмыДокумента - Массив - список имен учетных механизмов, для которых будет выполнена
//              регистрация в механизме проведения.
//
Процедура ЗарегистрироватьУчетныеМеханизмы(МеханизмыДокумента) Экспорт
	
	МеханизмыДокумента.Добавить("СведенияОНаценкеТНСС");
	
КонецПроцедуры

// Федоров Максим 25.03.2022 Выполнение задач №000040782
// Возвращает таблицы для движений, необходимые для проведения документа по регистрам учетных механизмов.
//
// Параметры:
//  Документ - ДокументСсылка - ссылка на документ, по которому необходимо получить данные
//  Регистры - Структура - список имен регистров, для которых необходимо получить таблицы
//  ДопПараметры - Структура - дополнительные параметры для получения данных, определяющие контекст проведения.
//
// Возвращаемое значение:
//  Структура - коллекция элементов:
//     * Таблица<ИмяРегистра> - ТаблицаЗначений - таблица данных для отражения в регистр.
//
Функция ДанныеДокументаДляПроведения(Документ, Регистры, ДопПараметры = Неопределено) Экспорт
	
	Если ДопПараметры = Неопределено Тогда
		ДопПараметры = ПроведениеДокументов.ДопПараметрыИнициализироватьДанныеДокументаДляПроведения();
	КонецЕсли;
	
	// НАЧАЛО Николаев Павел 29.03.2024 Выполнение задач №000049053
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.тн_РегистрацияНаценкиНаПродажу") Тогда
		ДокументСсылка = Документ.Ссылка;
	Иначе
		ДокументСсылка = Документ;
	КонецЕсли;
	// КОНЕЦ Николаев Павел 29.03.2024 Выполнение задач №000049053
	
	Запрос			= Новый Запрос;
	ТекстыЗапроса	= Новый СписокЗначений;
	
	Если Не ДопПараметры.ПолучитьТекстыЗапроса Тогда
		////////////////////////////////////////////////////////////////////////////
		// Создадим запрос инициализации движений
		
		// Создадим запрос инициализации движений
		
		// НАЧАЛО Николаев Павел 29.03.2024 Выполнение задач №000049053
		//Запрос.УстановитьПараметр("Ссылка", Документ);
		Запрос.УстановитьПараметр("Ссылка", ДокументСсылка);
		// КОНЕЦ Николаев Павел 29.03.2024 Выполнение задач №000049053
		
		////////////////////////////////////////////////////////////////////////////
		// Сформируем текст запроса
		
		ТекстЗапросаТаблицаНаценка(Запрос, ТекстыЗапроса, Регистры);
	
	КонецЕсли;
	
	////////////////////////////////////////////////////////////////////////////
	// Получим таблицы для движений
	
	Возврат ПроведениеДокументов.ИнициализироватьДанныеДокументаДляПроведения(Запрос, ТекстыЗапроса, ДопПараметры);
	
КонецФункции

// Федоров Максим 25.03.2022 Выполнение задач №000040782
Функция ТекстЗапросаТаблицаНаценка(Запрос, ТекстыЗапроса, Регистры)
	
	ИмяРегистра = "тн_СведенияОНаценкеТНСС";
	
	Если Не ПроведениеДокументов.ТребуетсяТаблицаДляДвижений(ИмяРегистра, Регистры) Тогда
		Возврат "";
	КонецЕсли; 

	ТекстЗапроса =
	"ВЫБРАТЬ
	|	тн_РегистрацияНаценкиНаПродажу.Дата КАК ПЕРИОД,
	|	тн_РегистрацияНаценкиНаПродажуНаценка.Контрагент КАК Контрагент,
	|	тн_РегистрацияНаценкиНаПродажуНаценка.Номенклатура КАК Номенклатура,
	|	тн_РегистрацияНаценкиНаПродажуНаценка.Количество КАК Количество,
	|	тн_РегистрацияНаценкиНаПродажуНаценка.ПроцентНаценки КАК ПроцентНаценки
	|ИЗ
	|	Документ.тн_РегистрацияНаценкиНаПродажу.Наценка КАК тн_РегистрацияНаценкиНаПродажуНаценка
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.тн_РегистрацияНаценкиНаПродажу КАК тн_РегистрацияНаценкиНаПродажу
	|		ПО тн_РегистрацияНаценкиНаПродажуНаценка.Ссылка = тн_РегистрацияНаценкиНаПродажу.Ссылка
	|ГДЕ
	|	тн_РегистрацияНаценкиНаПродажуНаценка.Ссылка = &Ссылка";

	ТекстыЗапроса.Добавить(ТекстЗапроса, ИмяРегистра);
	
	Возврат ТекстЗапроса;
	
КонецФункции
#КонецОбласти
#КонецОбласти
#КонецЕсли
